tap "1password/tap"
tap "homebrew/bundle"
tap "supabase/tap"
brew "act"
brew "xz"
brew "git"
brew "asdf"
brew "aws-vault"
brew "awscli"
brew "boost"
brew "pycparser"
brew "cffi"
brew "cmake"
brew "direnv"
brew "docutils"
brew "emojify"
brew "unbound"
brew "gnutls"
brew "ffmpeg"
brew "fzf"
brew "gh"
brew "grep"
brew "huggingface-cli"
brew "jq"
brew "kind"
brew "kubernetes-cli"
brew "libgcrypt"
brew "libomp", link: true
brew "llama.cpp"
brew "lolcat"
brew "minikube"
brew "neovim"
brew "peco"
brew "perl"
brew "poetry"
brew "python@3.10"
brew "python@3.11"
brew "sl"
brew "stern"
brew "tcl-tk"
brew "terraform-docs"
brew "tflint"
brew "tree"
brew "uv"
brew "vim"
brew "virtualenv"
brew "volta"
brew "wget"
brew "xplr"
brew "yq"
brew "supabase/tap/supabase"
cask "1password-cli"
cask "alfred"
cask "alt-tab"
cask "docker-desktop"
cask "font-hack-nerd-font"
cask "jordanbaird-ice"
cask "karabiner-elements"
cask "rectangle"
cask "visual-studio-code"
