tap "1password/tap"
tap "homebrew/bundle"
tap "supabase/tap"
brew "act"
brew "xz"
brew "asdf"
brew "aws-vault"
brew "pycparser"
brew "cffi"
brew "docutils"
brew "python@3.11"
brew "awscli"
brew "boost"
brew "cmake"
brew "direnv"
brew "emojify"
brew "fzf"
brew "gh"
brew "git"
brew "node"
brew "gitmoji"
brew "unbound"
brew "gnutls"
brew "grep"
brew "jq"
brew "kind"
brew "kubernetes-cli"
brew "libgcrypt"
brew "libomp", link: true
brew "minikube"
brew "peco"
brew "perl"
brew "virtualenv"
brew "poetry"
brew "python@3.10"
brew "stern"
brew "tcl-tk"
brew "terraform-docs"
brew "tflint"
brew "tree"
brew "vim"
brew "xplr"
brew "yq"
brew "supabase/tap/supabase"
cask "1password-cli"
cask "alfred"
cask "alt-tab"
cask "docker"
cask "dropbox"
cask "iterm2"
cask "karabiner-elements"
cask "rectangle"
cask "visual-studio-code"
vscode "antfu.slidev"
vscode "bradlc.vscode-tailwindcss"
vscode "christian-kohler.path-intellisense"
vscode "DavidAnson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "docsmsft.docs-yaml"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-rename-tag"
vscode "GitHub.vscode-pull-request-github"
vscode "hashicorp.terraform"
vscode "jebbs.plantuml"
vscode "marp-team.marp-vscode"
vscode "mechatroner.rainbow-csv"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.black-formatter"
vscode "ms-python.flake8"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "njpwerner.autodocstring"
vscode "Nuxt.mdc"
vscode "octref.vetur"
vscode "PKief.material-icon-theme"
vscode "redhat.vscode-yaml"
vscode "ritwickdey.LiveServer"
vscode "streetsidesoftware.code-spell-checker"
vscode "tamasfe.even-better-toml"
vscode "unifiedjs.vscode-mdx"
vscode "Vue.volar"
vscode "Vue.vscode-typescript-vue-plugin"
vscode "wayou.vscode-todo-highlight"
vscode "xabikos.JavaScriptSnippets"
vscode "yzhang.markdown-all-in-one"
