tap "1password/tap"
tap "anomalyco/tap"
tap "homebrew/bundle"
tap "supabase/tap"
brew "act"
brew "git"
brew "asdf"
brew "aws-vault"
brew "xz"
brew "awscli"
brew "boost"
brew "pycparser"
brew "cffi"
brew "cmake"
brew "direnv"
brew "docutils"
brew "emojify"
brew "fd"
brew "ffmpeg"
brew "fzf"
brew "gh"
brew "git-delta"
brew "unbound"
brew "gnutls"
brew "grep"
brew "huggingface-cli"
brew "iperf3"
brew "jq"
brew "kind"
brew "kubernetes-cli"
brew "lazygit"
brew "libgcrypt"
brew "libomp", link: true
brew "libpq"
brew "llama.cpp"
brew "lolcat"
brew "minikube"
brew "neovim"
brew "peco"
brew "perl"
brew "poetry"
brew "python@3.10"
brew "python@3.11"
brew "ripgrep"
brew "sl"
brew "stern"
brew "tcl-tk"
brew "terraform-docs"
brew "tflint"
brew "tmux"
brew "tree"
brew "uv"
brew "vim"
brew "virtualenv"
brew "volta"
brew "wget"
brew "xplr"
brew "yq"
brew "anomalyco/tap/opencode"
brew "supabase/tap/supabase"
cask "1password-cli"
cask "alfred"
cask "alt-tab"
cask "claude-code"
cask "codex"
cask "docker-desktop"
cask "dropbox"
cask "font-hack-nerd-font"
cask "iterm2"
cask "jordanbaird-ice"
cask "karabiner-elements"
cask "rectangle"
cask "visual-studio-code"
vscode "amazonwebservices.aws-toolkit-vscode"
vscode "anthropic.claude-code"
vscode "bradlc.vscode-tailwindcss"
vscode "charliermarsh.ruff"
vscode "christian-kohler.path-intellisense"
vscode "codezombiech.gitignore"
vscode "cweijan.dbclient-jdbc"
vscode "cweijan.vscode-database-client2"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "docker.docker"
vscode "docsmsft.docs-yaml"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-rename-tag"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-pull-request-github"
vscode "hashicorp.terraform"
vscode "hediet.vscode-drawio"
vscode "iliazeus.vscode-ansi"
vscode "marp-team.marp-vscode"
vscode "mechatroner.rainbow-csv"
vscode "ms-azuretools.vscode-containers"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.datawrangler"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "njpwerner.autodocstring"
vscode "nuxt.mdc"
vscode "openai.chatgpt"
vscode "pkief.material-icon-theme"
vscode "redhat.vscode-yaml"
vscode "ritwickdey.liveserver"
vscode "saoudrizwan.claude-dev"
vscode "streetsidesoftware.code-spell-checker"
vscode "tamasfe.even-better-toml"
vscode "unifiedjs.vscode-mdx"
vscode "vivaxy.vscode-conventional-commits"
vscode "vue.volar"
vscode "wayou.vscode-todo-highlight"
vscode "xabikos.javascriptsnippets"
vscode "yzhang.markdown-all-in-one"
