abusaidm.html-snippets
bungcip.better-toml
christian-kohler.path-intellisense
eamodio.gitlens
mechatroner.rainbow-csv
ms-azuretools.vscode-docker
ms-python.python
ms-python.vscode-pylance
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-vscode-remote.remote-containers
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-ssh-edit
PKief.material-icon-theme
redhat.vscode-yaml
streetsidesoftware.code-spell-checker
