antfu.slidev
bradlc.vscode-tailwindcss
christian-kohler.path-intellisense
DavidAnson.vscode-markdownlint
dbaeumer.vscode-eslint
docsmsft.docs-yaml
eamodio.gitlens
esbenp.prettier-vscode
formulahendry.auto-rename-tag
GitHub.vscode-pull-request-github
hashicorp.terraform
jebbs.plantuml
marp-team.marp-vscode
mechatroner.rainbow-csv
ms-azuretools.vscode-docker
ms-python.black-formatter
ms-python.flake8
ms-python.isort
ms-python.python
ms-python.vscode-pylance
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
ms-vscode-remote.remote-containers
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-ssh-edit
ms-vscode-remote.vscode-remote-extensionpack
ms-vscode.remote-explorer
ms-vscode.remote-server
njpwerner.autodocstring
Nuxt.mdc
octref.vetur
PKief.material-icon-theme
redhat.vscode-yaml
ritwickdey.LiveServer
streetsidesoftware.code-spell-checker
tamasfe.even-better-toml
unifiedjs.vscode-mdx
Vue.volar
Vue.vscode-typescript-vue-plugin
wayou.vscode-todo-highlight
xabikos.JavaScriptSnippets
yzhang.markdown-all-in-one
